[
  {
    "id": {
      "title": "Java Backend Developer",
      "company": "PT Solusi Teknologi Sejati",
      "period": "Aug 2024 – Dec 2025",
      "context": "Saya bekerja pada pengembangan dan pemeliharaan sistem backend enterprise untuk perusahaan yang bergerak di bidang optik (kacamata, lensa, dan softlens). Sistem ini mencakup modul POS, inventory, purchasing, dan pelaporan operasional, serta menangani transaksi harian dalam skala besar.",
      "responsibilities": [
        "Mengembangkan dan memelihara modul backend ERP dan POS menggunakan Java dan Spring Boot (framework internal jLeaf)",
        "Menangani logika bisnis kompleks di level database untuk transaksi POS dan inventory",
        "Mengelola validasi transaksi, pemrosesan input berbasis JSON, dan konsistensi data lintas tabel",
        "Menangani integrasi data lintas sistem, termasuk sinkronisasi transaksi dengan sistem supplier",
        "Melakukan optimasi performa database dan proses import data massal",
        "Menangani incident production, termasuk transaksi gagal dan data tidak konsisten, serta melakukan reprocess data",
        "Melakukan testing, debugging, dan analisis dampak perubahan terhadap sistem yang sudah berjalan",
        "Bekerja dengan alur merge request dan code review bersama supervisor dan manager"
      ],
      "achievements": [
        "Mengoptimalkan proses import data massal (POS, GTI, GTO, Purchasing) dari ±30 menit menjadi ±3 menit untuk lebih dari 15.000 data",
        "Menjaga stabilitas dan konsistensi data transaksi yang berdampak langsung pada laporan bisnis",
        "Membantu meningkatkan keandalan sistem POS pada kondisi beban transaksi tinggi"
      ],
      "skills": ["Java", "Spring Boot", "jLeaf", "PostgreSQL", "SQL", "JSF", "PrimeFaces", "ActiveMQ", "Golang (project-based)"]
    },
    "en": {
      "title": "Java Backend Developer",
      "company": "PT Solusi Teknologi Sejati",
      "period": "Aug 2024 – Dec 2025",
      "context": "I worked on developing and maintaining enterprise backend systems for a company in the optical industry (glasses, lenses, and soft contact lenses). The system includes POS, inventory, purchasing, and operational reporting modules, handling large-scale daily transactions.",
      "responsibilities": [
        "Developed and maintained ERP and POS backend modules using Java and Spring Boot (internal jLeaf framework)",
        "Handled complex business logic at database level for POS and inventory transactions",
        "Managed transaction validation, JSON-based input processing, and data consistency across tables",
        "Handled cross-system data integration, including transaction synchronization with supplier systems",
        "Performed database performance optimization and bulk data import processes",
        "Handled production incidents, including failed transactions and inconsistent data, and performed data reprocessing",
        "Performed testing, debugging, and impact analysis of changes to existing systems",
        "Worked with merge request workflow and code review with supervisor and manager"
      ],
      "achievements": [
        "Optimized bulk data import process (POS, GTI, GTO, Purchasing) from ±30 minutes to ±3 minutes for over 15,000 records",
        "Maintained transaction data stability and consistency that directly impacts business reports",
        "Helped improve POS system reliability under high transaction load conditions"
      ],
      "skills": ["Java", "Spring Boot", "jLeaf", "PostgreSQL", "SQL", "JSF", "PrimeFaces", "ActiveMQ", "Golang (project-based)"]
    }
  },
  {
    "id": {
      "title": "Java Backend Developer",
      "company": "PT Fintek Digital Indonesia",
      "period": "May 2023 – Feb 2024",
      "context": "Terlibat dalam pengembangan backend untuk sistem berbasis layanan keuangan dan data, dengan fokus pada pembuatan API dan integrasi antar komponen sistem.",
      "responsibilities": [
        "Mengembangkan API endpoint menggunakan Spring Boot",
        "Mengimplementasikan dan memelihara fitur backend sesuai kebutuhan bisnis",
        "Berpartisipasi dalam daily meeting dan diskusi progres pengembangan",
        "Melakukan review kode untuk pull request dari developer lain"
      ],
      "skills": ["Java", "Spring Boot", "MySQL", "Spring Data JPA", "Spring Security", "RabbitMQ", "Redis"]
    },
    "en": {
      "title": "Java Backend Developer",
      "company": "PT Fintek Digital Indonesia",
      "period": "May 2023 – Feb 2024",
      "context": "Involved in backend development for financial services and data-based systems, focusing on API creation and integration between system components.",
      "responsibilities": [
        "Developed API endpoints using Spring Boot",
        "Implemented and maintained backend features according to business requirements",
        "Participated in daily meetings and development progress discussions",
        "Performed code reviews for pull requests from other developers"
      ],
      "skills": ["Java", "Spring Boot", "MySQL", "Spring Data JPA", "Spring Security", "RabbitMQ", "Redis"]
    }
  },
  {
    "id": {
      "title": "Java Backend Developer",
      "company": "PT Infosys Solusi Terpadu",
      "period": "May 2022 – Jan 2023",
      "context": "Bekerja pada pengembangan backend aplikasi perbankan syariah yang digunakan untuk mendukung proses bisnis dan layanan internal.",
      "responsibilities": [
        "Mengembangkan dan memelihara aplikasi backend menggunakan Spring Boot",
        "Membuat dan mengelola API endpoint",
        "Mengembangkan fitur baru sesuai kebutuhan proyek",
        "Menggunakan PostgreSQL sebagai basis data utama",
        "Membuat unit test untuk memastikan kualitas dan stabilitas aplikasi",
        "Berkolaborasi dengan tim lain untuk debugging dan penyelesaian masalah",
        "Mengikuti daily meeting, update progres, dan code review"
      ],
      "skills": ["Java", "Spring Boot", "PostgreSQL", "Spring Data JPA", "JUnit", "Mockito"]
    },
    "en": {
      "title": "Java Backend Developer",
      "company": "PT Infosys Solusi Terpadu",
      "period": "May 2022 – Jan 2023",
      "context": "Worked on backend development for sharia banking applications used to support business processes and internal services.",
      "responsibilities": [
        "Developed and maintained backend applications using Spring Boot",
        "Created and managed API endpoints",
        "Developed new features according to project requirements",
        "Used PostgreSQL as the primary database",
        "Created unit tests to ensure application quality and stability",
        "Collaborated with other teams for debugging and problem resolution",
        "Attended daily meetings, progress updates, and code reviews"
      ],
      "skills": ["Java", "Spring Boot", "PostgreSQL", "Spring Data JPA", "JUnit", "Mockito"]
    }
  }
]
